zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_sfu.h
 /**   
  *******************************************************************************************************
  * @file    fm33fg0xxa_fl_sfu.h
  * @author  FMSH Application Team
  * @brief   Head file of SFU FL Module 
  *******************************************************************************************************  
  * @attention    
  * Copyright (c) 2023, SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICROELECTRONICS./ FUDAN MICRO.)    
  * All rights reserved.    
  *    
  * Processor:                   FM33FG0xxA    
  * http:                        http://www.fmdevelopers.com.cn/    
  *    
  * Redistribution and use in source and binary forms, with or without    
  * modification, are permitted provided that the following conditions are met    
  *    
  * 1. Redistributions of source code must retain the above copyright notice,    
  *    this list of conditions and the following disclaimer.    
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,    
  *    this list of conditions and the following disclaimer in the documentation    
  *    and/or other materials provided with the distribution.    
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors    
  *    may be used to endorse or promote products derived from this software    
  *    without specific prior written permission.    
  *    
  * 4. To provide the most up-to-date information, the revision of our documents     
  *    on the World Wide Web will be the most Current. Your printed copy may be      
  *    an earlier revision. To verify you have the latest information avaliable,    
  *    refer to: http://www.fmdevelopers.com.cn/.    
  *    
  * THIS SOFTWARE IS PROVIDED BY FUDAN MICRO "AS IS" AND ANY EXPRESSED:     
  * ORIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES     
  * OF MERCHANTABILITY NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE    
  * ARE DISCLAIMED.IN NO EVENT SHALL FUDAN MICRO OR ITS CONTRIBUTORS BE LIABLE     
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL     
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS     
  * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER    
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,     
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISINGIN ANY WAY OUT OF THE     
  * USE OF THIS SOFTWARE, EVEN IF ADVISED OFTHE POSSIBILITY OF SUCH DAMAGE.    
  *
  *******************************************************************************************************
  */    


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FG0XXA_FL_SFU_H
#define __FM33FG0XXA_FL_SFU_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fg0xxa_fl_def.h"
/** @addtogroup FM33FG0XXA_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup SFU_FL_ES_INIT SFU Exported Init structures
  * @{
  */

/**
  * @brief FL SFU Init Sturcture definition
  */

/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup SFU_FL_Exported_Constants SFU Exported Constants
  * @{
  */

#define    SFU_MAPCR_WKP_Pos                                      (26U)
#define    SFU_MAPCR_WKP_Msk                                      (0x1U << SFU_MAPCR_WKP_Pos)
#define    SFU_MAPCR_WKP                                          SFU_MAPCR_WKP_Msk

#define    SFU_MAPCR_EXTIP_Pos                                    (25U)
#define    SFU_MAPCR_EXTIP_Msk                                    (0x1U << SFU_MAPCR_EXTIP_Pos)
#define    SFU_MAPCR_EXTIP                                        SFU_MAPCR_EXTIP_Msk

#define    SFU_MAPCR_GPIOIP_Pos                                   (24U)
#define    SFU_MAPCR_GPIOIP_Msk                                   (0x1U << SFU_MAPCR_GPIOIP_Pos)
#define    SFU_MAPCR_GPIOIP                                       SFU_MAPCR_GPIOIP_Msk

#define    SFU_MAPCR_GPIOHP_Pos                                   (23U)
#define    SFU_MAPCR_GPIOHP_Msk                                   (0x1U << SFU_MAPCR_GPIOHP_Pos)
#define    SFU_MAPCR_GPIOHP                                       SFU_MAPCR_GPIOHP_Msk

#define    SFU_MAPCR_GPIOGP_Pos                                   (22U)
#define    SFU_MAPCR_GPIOGP_Msk                                   (0x1U << SFU_MAPCR_GPIOGP_Pos)
#define    SFU_MAPCR_GPIOGP                                       SFU_MAPCR_GPIOGP_Msk

#define    SFU_MAPCR_GPIOFP_Pos                                   (21U)
#define    SFU_MAPCR_GPIOFP_Msk                                   (0x1U << SFU_MAPCR_GPIOFP_Pos)
#define    SFU_MAPCR_GPIOFP                                       SFU_MAPCR_GPIOFP_Msk

#define    SFU_MAPCR_GPIOEP_Pos                                   (20U)
#define    SFU_MAPCR_GPIOEP_Msk                                   (0x1U << SFU_MAPCR_GPIOEP_Pos)
#define    SFU_MAPCR_GPIOEP                                       SFU_MAPCR_GPIOEP_Msk

#define    SFU_MAPCR_GPIODP_Pos                                   (19U)
#define    SFU_MAPCR_GPIODP_Msk                                   (0x1U << SFU_MAPCR_GPIODP_Pos)
#define    SFU_MAPCR_GPIODP                                       SFU_MAPCR_GPIODP_Msk

#define    SFU_MAPCR_GPIOCP_Pos                                   (18U)
#define    SFU_MAPCR_GPIOCP_Msk                                   (0x1U << SFU_MAPCR_GPIOCP_Pos)
#define    SFU_MAPCR_GPIOCP                                       SFU_MAPCR_GPIOCP_Msk

#define    SFU_MAPCR_GPIOBP_Pos                                   (17U)
#define    SFU_MAPCR_GPIOBP_Msk                                   (0x1U << SFU_MAPCR_GPIOBP_Pos)
#define    SFU_MAPCR_GPIOBP                                       SFU_MAPCR_GPIOBP_Msk

#define    SFU_MAPCR_GPIOAP_Pos                                   (16U)
#define    SFU_MAPCR_GPIOAP_Msk                                   (0x1U << SFU_MAPCR_GPIOAP_Pos)
#define    SFU_MAPCR_GPIOAP                                       SFU_MAPCR_GPIOAP_Msk

#define    SFU_MAPCR_CLM1P_Pos                                    (13U)
#define    SFU_MAPCR_CLM1P_Msk                                    (0x1U << SFU_MAPCR_CLM1P_Pos)
#define    SFU_MAPCR_CLM1P                                        SFU_MAPCR_CLM1P_Msk

#define    SFU_MAPCR_CLM0P_Pos                                    (12U)
#define    SFU_MAPCR_CLM0P_Msk                                    (0x1U << SFU_MAPCR_CLM0P_Pos)
#define    SFU_MAPCR_CLM0P                                        SFU_MAPCR_CLM0P_Msk

#define    SFU_MAPCR_CMPP_Pos                                     (11U)
#define    SFU_MAPCR_CMPP_Msk                                     (0x1U << SFU_MAPCR_CMPP_Pos)
#define    SFU_MAPCR_CMPP                                         SFU_MAPCR_CMPP_Msk

#define    SFU_MAPCR_WWP_Pos                                      (10U)
#define    SFU_MAPCR_WWP_Msk                                      (0x1U << SFU_MAPCR_WWP_Pos)
#define    SFU_MAPCR_WWP                                          SFU_MAPCR_WWP_Msk

#define    SFU_MAPCR_IWP_Pos                                      (9U)
#define    SFU_MAPCR_IWP_Msk                                      (0x1U << SFU_MAPCR_IWP_Pos)
#define    SFU_MAPCR_IWP                                          SFU_MAPCR_IWP_Msk

#define    SFU_MAPCR_NVMP_Pos                                     (8U)
#define    SFU_MAPCR_NVMP_Msk                                     (0x1U << SFU_MAPCR_NVMP_Pos)
#define    SFU_MAPCR_NVMP                                         SFU_MAPCR_NVMP_Msk

