zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_sfu.h
/**
  * @brief    Get RAM Write Protection Size
  * @rmtoll   MAPCR    RAMWP    FL_SFU_GetRAMWriteProtectionSize
  * @param    SFUx SFU instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SFU_RAMWP_SIZE_NONE
  *           @arg @ref FL_SFU_RAMWP_SIZE_1K
  *           @arg @ref FL_SFU_RAMWP_SIZE_2K
  *           @arg @ref FL_SFU_RAMWP_SIZE_4K
  */
__STATIC_INLINE uint32_t FL_SFU_GetRAMWriteProtectionSize(SFU_Type* SFUx)
{
    return (uint32_t)(READ_BIT(SFUx->MAPCR, SFU_MAPCR_RAMWP_Msk));
}

/**
  * @brief    Enable Memory Access Protection
  * @rmtoll   MAPCR    MAP_EN    FL_SFU_EnableMemoryAccessProtection
  * @param    SFUx SFU instance
  * @retval   None
  */
__STATIC_INLINE void FL_SFU_EnableMemoryAccessProtection(SFU_Type* SFUx)
{
    SET_BIT(SFUx->MAPCR, SFU_MAPCR_MAP_EN_Msk);
}

/**
  * @brief    Get Memory Access Protection Enable Status
  * @rmtoll   MAPCR    MAP_EN    FL_SFU_IsEnabledMemoryAccessProtection
  * @param    SFUx SFU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SFU_IsEnabledMemoryAccessProtection(SFU_Type* SFUx)
{
    return (uint32_t)(READ_BIT(SFUx->MAPCR, SFU_MAPCR_MAP_EN_Msk) == SFU_MAPCR_MAP_EN_Msk);
}

/**
  * @brief    Clear Memory Access Protection Interrupt Flag
  * @rmtoll   MAPSR    MAP_IF    FL_SFU_ClearFlag_MemoryAccessProtection
  * @param    SFUx SFU instance
  * @retval   None
  */
__STATIC_INLINE void FL_SFU_ClearFlag_MemoryAccessProtection(SFU_Type* SFUx)
{
    WRITE_REG(SFUx->MAPSR, SFU_MAPSR_MAP_IF_Msk);
}

/**
  * @brief    Get Memory Access Protection Interrupt Flag
  * @rmtoll   MAPSR    MAP_IF    FL_SFU_IsActiveFlag_MemoryAccessProtection
  * @param    SFUx SFU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SFU_IsActiveFlag_MemoryAccessProtection(SFU_Type* SFUx)
{
    return (uint32_t)(READ_BIT(SFUx->MAPSR, SFU_MAPSR_MAP_IF_Msk) == (SFU_MAPSR_MAP_IF_Msk));
}

/**
  * @}
  */

/** @defgroup SFU_FL_EF_Init Initialization and de-initialization functions
  * @{
  */


/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33FG0XXA_FL_SFU_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-06-01*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
